; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	thermograph5 - mode
	infrared1 - mode
	infrared3 - mode
	image0 - mode
	infrared4 - mode
	image2 - mode
	GroundStation2 - direction
	Star3 - direction
	GroundStation4 - direction
	Star6 - direction
	Star5 - direction
	GroundStation0 - direction
	GroundStation1 - direction
	Phenomenon7 - direction
	Phenomenon8 - direction
	Planet9 - direction
	Phenomenon10 - direction
	Phenomenon11 - direction
	Star12 - direction
	Star13 - direction
	Star14 - direction
)
(:init
	(supports instrument0 image2)
	(supports instrument0 infrared3)
	(calibration_target instrument0 GroundStation0)
	(supports instrument1 thermograph5)
	(supports instrument1 infrared4)
	(calibration_target instrument1 GroundStation1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation1)
	(supports instrument2 infrared4)
	(supports instrument2 image0)
	(supports instrument2 thermograph5)
	(calibration_target instrument2 Star5)
	(supports instrument3 infrared3)
	(supports instrument3 image2)
	(supports instrument3 infrared1)
	(calibration_target instrument3 GroundStation1)
	(calibration_target instrument3 GroundStation0)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star12)
)
(:goal (and
	(pointing satellite0 Star13)
	(have_image Phenomenon7 thermograph5)
	(have_image Phenomenon7 infrared4)
	(have_image Phenomenon8 infrared4)
	(have_image Planet9 infrared1)
	(have_image Phenomenon10 infrared3)
	(have_image Phenomenon10 thermograph5)
	(have_image Phenomenon11 image0)
	(have_image Phenomenon11 infrared4)
	(have_image Star12 infrared4)
	(have_image Star12 image2)
	(have_image Star13 infrared4)
	(have_image Star14 infrared4)
	(have_image Star14 infrared1)
))

)

; plan
1. (turn_to satellite1 groundstation0 star12)
   deleted: (pointing satellite1 star12)
   added: (pointing satellite1 groundstation0)
   goals met: 0 of 14
2. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 14
3. (calibrate satellite1 instrument3 groundstation0)
   added: (calibrated instrument3)
   goals met: 0 of 14
4. (turn_to satellite1 star14 groundstation0)
   deleted: (pointing satellite1 groundstation0)
   added: (pointing satellite1 star14)
   goals met: 0 of 14
5. (take_image satellite1 star14 instrument3 infrared1)
   added: (have_image star14 infrared1)
   goals met: 1 of 14
6. (turn_to satellite1 star12 star14)
   deleted: (pointing satellite1 star14)
   added: (pointing satellite1 star12)
   goals met: 1 of 14
7. (take_image satellite1 star12 instrument3 image2)
   added: (have_image star12 image2)
   goals met: 2 of 14
8. (turn_to satellite1 planet9 star12)
   deleted: (pointing satellite1 star12)
   added: (pointing satellite1 planet9)
   goals met: 2 of 14
9. (take_image satellite1 planet9 instrument3 infrared1)
   added: (have_image planet9 infrared1)
   goals met: 3 of 14
10. (turn_to satellite1 phenomenon10 planet9)
   deleted: (pointing satellite1 planet9)
   added: (pointing satellite1 phenomenon10)
   goals met: 3 of 14
11. (turn_to satellite0 star13 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 star13)
   goals met: 4 of 14
12. (take_image satellite1 phenomenon10 instrument3 infrared3)
   added: (have_image phenomenon10 infrared3)
   goals met: 5 of 14
13. (switch_off instrument3 satellite1)
   deleted: (power_on instrument3)
   added: (power_avail satellite1)
   goals met: 5 of 14
14. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 5 of 14
15. (turn_to satellite1 star5 phenomenon10)
   deleted: (pointing satellite1 phenomenon10)
   added: (pointing satellite1 star5)
   goals met: 5 of 14
16. (calibrate satellite1 instrument2 star5)
   added: (calibrated instrument2)
   goals met: 5 of 14
17. (turn_to satellite1 phenomenon10 star5)
   deleted: (pointing satellite1 star5)
   added: (pointing satellite1 phenomenon10)
   goals met: 5 of 14
18. (take_image satellite1 phenomenon10 instrument2 thermograph5)
   added: (have_image phenomenon10 thermograph5)
   goals met: 6 of 14
19. (turn_to satellite1 phenomenon11 phenomenon10)
   deleted: (pointing satellite1 phenomenon10)
   added: (pointing satellite1 phenomenon11)
   goals met: 6 of 14
20. (take_image satellite1 phenomenon11 instrument2 image0)
   added: (have_image phenomenon11 image0)
   goals met: 7 of 14
21. (take_image satellite1 phenomenon11 instrument2 infrared4)
   added: (have_image phenomenon11 infrared4)
   goals met: 8 of 14
22. (turn_to satellite1 phenomenon7 phenomenon11)
   deleted: (pointing satellite1 phenomenon11)
   added: (pointing satellite1 phenomenon7)
   goals met: 8 of 14
23. (take_image satellite1 phenomenon7 instrument2 infrared4)
   added: (have_image phenomenon7 infrared4)
   goals met: 9 of 14
24. (take_image satellite1 phenomenon7 instrument2 thermograph5)
   added: (have_image phenomenon7 thermograph5)
   goals met: 10 of 14
25. (turn_to satellite1 phenomenon8 phenomenon7)
   deleted: (pointing satellite1 phenomenon7)
   added: (pointing satellite1 phenomenon8)
   goals met: 10 of 14
26. (take_image satellite1 phenomenon8 instrument2 infrared4)
   added: (have_image phenomenon8 infrared4)
   goals met: 11 of 14
27. (turn_to satellite1 star12 phenomenon8)
   deleted: (pointing satellite1 phenomenon8)
   added: (pointing satellite1 star12)
   goals met: 11 of 14
28. (take_image satellite1 star12 instrument2 infrared4)
   added: (have_image star12 infrared4)
   goals met: 12 of 14
29. (turn_to satellite1 star13 star12)
   deleted: (pointing satellite1 star12)
   added: (pointing satellite1 star13)
   goals met: 12 of 14
30. (take_image satellite1 star13 instrument2 infrared4)
   added: (have_image star13 infrared4)
   goals met: 13 of 14
31. (turn_to satellite1 star14 star13)
   deleted: (pointing satellite1 star13)
   added: (pointing satellite1 star14)
   goals met: 13 of 14
32. (take_image satellite1 star14 instrument2 infrared4)
   added: (have_image star14 infrared4)
   goals met: 14 of 14
